Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ.LipLength
Lip segment length.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ.BottomFlangeLength
Bottom Flange segment length.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of Z Cold Formed shape.
width:
Section width.
height:
Section height, depth.
wallNominalThickness:
Represents wall nominal thickness of rectangle.
wallDesignThickness:
Represents wall design thickness of rectangle.
innerFillet:
Inner Fillet - Corner fillet inner radius.
bottomFlangeLength:
Bottom Flange segment length.
lipLength:
Lip segment length.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ
Defines parameters for Z Cold Formed shape.
Since:
2018